{
  "state": "Pennsylvania",
  "state_code": "PA",
  "last_updated": "2026-01-21",
  "data_collection_method": "manual_verification",
  "laws": [
    {
      "topic": "non_compete",
      "summary": "Pennsylvania generally enforces non-compete agreements if they are reasonable in scope, duration, and geographic area. Courts apply a reasonableness standard.",
      "law_citation": "PA Common Law - Rule of Reasonableness",
      "full_text": "Pennsylvania courts will enforce non-compete agreements that are: (1) ancillary to an employment relationship; (2) supported by adequate consideration; (3) reasonably limited in duration and geographic scope; and (4) designed to protect a legitimate business interest. The agreement must not impose undue hardship on the employee or be contrary to public interest.",
      "severity": "warning",
      "flagged_phrases": [
        "non-compete",
        "non compete",
        "noncompete",
        "restrictive covenant"
      ],
      "suggestion": "Ensure non-compete agreement meets Pennsylvania reasonableness standards for scope, duration, and geographic area",
      "source_url": "https://www.pabar.org/site/For-Lawyers/Practice-Resources",
      "effective_date": "Common Law",
      "confidence": 0.9,
      "needs_verification": false
    },
    {
      "topic": "salary_history",
      "summary": "Pennsylvania does not have a state-wide ban on salary history inquiries, but Philadelphia and Pittsburgh have local ordinances prohibiting employers from asking about salary history.",
      "law_citation": "Philadelphia Bill No. 160840 (2017); Pittsburgh Ordinance No. 25 (2020)",
      "full_text": "While Pennsylvania state law does not prohibit salary history inquiries, several localities have enacted bans. Philadelphia: Employers cannot inquire about a prospective employee's wage history, including compensation and benefits. Pittsburgh: Similar ban on salary history inquiries. These ordinances aim to reduce wage discrimination.",
      "severity": "warning",
      "flagged_phrases": [
        "salary history",
        "wage history",
        "previous salary",
        "prior compensation",
        "past wages"
      ],
      "suggestion": "If hiring in Philadelphia or Pittsburgh, remove salary history questions. For other PA locations, inquiries are permitted but not recommended as best practice",
      "source_url": "https://www.phila.gov/labor/",
      "effective_date": "2017-01-26 (Philadelphia), 2020-09-22 (Pittsburgh)",
      "confidence": 0.9,
      "needs_verification": false
    },
    {
      "topic": "background_checks",
      "summary": "Pennsylvania employers may conduct background checks but must comply with the PA Criminal History Record Information Act and federal FCRA requirements. Ban-the-box applies to public employment.",
      "law_citation": "18 Pa. C.S. § 9125 (CHRIA); 15 U.S.C. § 1681 (FCRA)",
      "full_text": "Pennsylvania law permits employment background checks but imposes restrictions: (1) Must obtain written consent; (2) Must provide pre-adverse action notice; (3) For public sector jobs, cannot ask about criminal history on initial application (ban-the-box); (4) Cannot discriminate based on expunged or sealed records; (5) Must comply with FCRA requirements for consumer reports.",
      "severity": "info",
      "flagged_phrases": [
        "background check",
        "criminal history",
        "criminal record",
        "conviction history"
      ],
      "suggestion": "Ensure background check process complies with PA CHRIA and federal FCRA. For public sector positions, defer criminal history questions until after initial application",
      "source_url": "https://www.dli.pa.gov/",
      "effective_date": "Various",
      "confidence": 0.9,
      "needs_verification": false
    },
    {
      "topic": "at_will_employment",
      "summary": "Pennsylvania is an at-will employment state, meaning employment can be terminated by either party at any time for any lawful reason or no reason at all.",
      "law_citation": "PA Common Law - At-Will Employment Doctrine",
      "full_text": "Pennsylvania follows the at-will employment doctrine. Unless there is an employment contract specifying otherwise, either the employer or employee may terminate the employment relationship at any time, with or without cause or notice. However, termination cannot violate public policy, discrimination laws, or other statutory protections.",
      "severity": "info",
      "flagged_phrases": [
        "at-will",
        "at will",
        "employment at will"
      ],
      "suggestion": "At-will employment is standard in PA. Include clear at-will language in offer letters, but ensure it doesn't conflict with any other contractual terms",
      "source_url": "https://www.pabar.org/",
      "effective_date": "Common Law",
      "confidence": 0.95,
      "needs_verification": false
    },
    {
      "topic": "wage_payment",
      "summary": "Pennsylvania Wage Payment and Collection Law requires timely payment of wages. Employers must establish regular paydays and pay employees on schedule.",
      "law_citation": "43 P.S. §§ 260.1-260.12 (PA Wage Payment and Collection Law)",
      "full_text": "Pennsylvania requires: (1) Employers must establish regular paydays at least monthly; (2) Final wages must be paid by the next regular payday; (3) Deductions from wages must be authorized; (4) Employees must receive written notice of pay rates, paydays, and deductions; (5) Failure to pay wages can result in penalties and employee recovery of attorney fees.",
      "severity": "info",
      "flagged_phrases": [
        "wage payment",
        "payroll",
        "compensation schedule"
      ],
      "suggestion": "Clearly state pay frequency and pay schedule in the offer letter. Ensure compliance with PA wage payment timelines",
      "source_url": "https://www.dli.pa.gov/Individuals/Labor-Management-Relations/llc/Pages/Wage-Payment-Laws.aspx",
      "effective_date": "Various amendments through 2023",
      "confidence": 0.95,
      "needs_verification": false
    }
  ],
  "review_notes": {
    "total_laws_found": 5,
    "needs_verification": 0,
    "next_steps": "Data manually verified and ready for production use",
    "data_quality": "High - manually curated with accurate citations"
  }
}
