{
  "state": "Arizona",
  "state_code": "AZ",
  "laws": [
    {
      "topic": "non-compete",
      "summary": "Arizona enforces non-compete agreements but with statutory restrictions. A.R.S. § 23-494 allows non-competes that are reasonable in time, geographic area, and scope. Courts will reform unreasonable provisions. Non-competes must protect legitimate business interests. Generally employer-friendly but not as permissive as some states.",
      "statute_citation": "A.R.S. § 23-494 (Arizona Non-Competition Agreement Statute)",
      "requirements": [
        "Must be reasonable in duration (no specific statutory limit, but courts typically find 1-2 years reasonable)",
        "Must be reasonable in geographic scope (limited to area where employer conducts business)",
        "Must be reasonable in scope of restricted activities",
        "Must protect legitimate business interest (trade secrets, confidential information, substantial customer relationships, specialized training)",
        "Must be ancillary to lawful employment relationship",
        "Courts will reform (blue-pencil) overly broad agreements to make them reasonable",
        "Cannot be used to restrain ordinary competition",
        "Must be supported by consideration (new employment or continued employment with new duties/benefits)",
        "Broadcast industry: Special restrictions apply (A.R.S. § 23-494.01) - cannot exceed 1 year, limited geographic scope",
        "Physicians: Can enforce non-competes in certain circumstances but with limitations"
      ],
      "effective_date": "1996 (amended multiple times)",
      "confidence_level": "high",
      "source_url": "https://www.azleg.gov/ars/23/00494.htm",
      "notes": "Arizona statute specifically authorizes courts to modify unreasonable provisions. Federal FTC ban blocked in 2024. Broadcast industry has special protections."
    },
    {
      "topic": "salary_history",
      "summary": "Arizona has NO statewide salary history ban. Employers may ask about and consider applicant salary history when setting compensation. No state-level restrictions on salary history inquiries.",
      "statute_citation": "No Arizona statute",
      "requirements": [
        "STATEWIDE: No restriction on asking about salary history",
        "Employers may ask applicants about prior compensation",
        "Employers may use salary history in setting compensation",
        "No state penalties for salary history inquiries",
        "Federal equal pay laws still apply (Equal Pay Act, Title VII)",
        "Some employers voluntarily avoid asking for equity reasons"
      ],
      "effective_date": "N/A - No law enacted",
      "confidence_level": "high",
      "source_url": "https://www.shrm.org/topics-tools/news/talent-acquisition/state-state-salary-history-bans-pay-transparency-laws",
      "notes": "Arizona has not enacted salary history ban legislation. Employers have broad discretion."
    },
    {
      "topic": "pay_transparency",
      "summary": "Arizona has NO statewide pay transparency law requiring salary ranges in job postings. No requirement to disclose compensation ranges to applicants or employees. No pay data reporting mandates.",
      "statute_citation": "No Arizona statute",
      "requirements": [
        "STATEWIDE: No requirement to include salary ranges in job postings",
        "STATEWIDE: No requirement to disclose pay ranges to applicants",
        "STATEWIDE: No requirement to disclose pay ranges to current employees",
        "STATEWIDE: No pay data reporting requirements",
        "Federal equal pay laws still apply",
        "Employers may voluntarily disclose pay ranges"
      ],
      "effective_date": "N/A - No law enacted",
      "confidence_level": "high",
      "source_url": "https://www.paycor.com/resource-center/articles/pay-transparency-laws-by-state/",
      "notes": "Arizona has not enacted pay transparency legislation. No posting requirements."
    },
    {
      "topic": "background_checks",
      "summary": "Arizona has limited ban-the-box protections. Executive Order 2017-07 prohibits state agencies from asking about criminal history on initial applications. Private employers generally can ask about criminal history at any stage. Must comply with federal FCRA.",
      "statute_citation": "Executive Order 2017-07 (state agencies); Federal FCRA (15 U.S.C. § 1681); A.R.S. § 13-904(E) (employment discrimination based on expunged records)",
      "requirements": [
        "STATE AGENCIES: Cannot ask about criminal history on initial application (Executive Order 2017-07)",
        "PRIVATE EMPLOYERS: Generally can ask about criminal history on applications",
        "PRIVATE EMPLOYERS: Must comply with federal FCRA",
        "Cannot discriminate based on expunged or set-aside conviction (A.R.S. § 13-904(E))",
        "FCRA: Must get written consent before background check",
        "FCRA: Must provide pre-adverse action notice with copy of report",
        "FCRA: Must provide final adverse action notice with dispute rights",
        "FCRA: Seven-year lookback for most non-conviction records",
        "FCRA: Ten-year lookback for bankruptcies",
        "FCRA: No time limit on convictions",
        "FCRA: $75,000+ salary positions exempt from lookback limits",
        "Must consider: nature of crime, time elapsed, job duties, rehabilitation",
        "Cannot discriminate based solely on arrest without conviction"
      ],
      "effective_date": "Executive Order: 2017; FCRA ongoing",
      "confidence_level": "high",
      "source_url": "https://www.goodhire.com/background-checks/arizona/",
      "notes": "Arizona is employer-friendly with minimal state restrictions. Federal FCRA provides primary regulation. Expunged records cannot be used."
    },
    {
      "topic": "paid_leave",
      "summary": "Arizona has NO statewide paid sick leave or paid leave mandate for private employers. No state law requires employers to provide paid or unpaid sick leave beyond federal FMLA. Some local jurisdictions may have requirements, but state law preempts most local ordinances.",
      "statute_citation": "No Arizona statute; Federal FMLA (29 U.S.C. § 2601)",
      "requirements": [
        "STATEWIDE: No requirement for paid sick leave",
        "STATEWIDE: No requirement for unpaid sick leave beyond federal FMLA",
        "Private employers not required to provide sick leave benefits",
        "Federal FMLA applies to employers with 50+ employees: up to 12 weeks unpaid leave",
        "FMLA requirements: employee worked 1,250 hours in past 12 months, employed 12+ months, employer has 50+ employees within 75 miles",
        "Employers may establish own sick leave policies",
        "State law generally preempts local paid leave ordinances",
        "No state penalties for lack of paid leave"
      ],
      "effective_date": "N/A - No state law",
      "confidence_level": "high",
      "source_url": "https://www.dol.gov/agencies/whd/fmla",
      "notes": "Arizona has no paid leave mandates. Very employer-friendly state on leave policies."
    },
    {
      "topic": "arbitration",
      "summary": "Arizona generally enforces arbitration agreements under federal and state law. Follows Federal Arbitration Act. Arizona has enacted Uniform Arbitration Act. Agreements must be clear, mutual, and not unconscionable. Courts favor arbitration.",
      "statute_citation": "Federal Arbitration Act (9 U.S.C. §§ 1-16); A.R.S. § 12-1501 et seq. (Uniform Arbitration Act)",
      "requirements": [
        "Arbitration agreements generally enforceable under FAA and Arizona Uniform Arbitration Act",
        "Must be in writing and signed by both parties",
        "Must have mutual agreement to arbitrate",
        "Must identify claims subject to arbitration",
        "Cannot be unconscionable",
        "Must provide for neutral arbitrator",
        "Adequate consideration required",
        "Arizona courts favor arbitration",
        "Class action waivers generally enforceable",
        "Pre-dispute arbitration agreements enforceable",
        "Can be challenged on contract grounds (fraud, duress, unconscionability)",
        "Federal policy favoring arbitration applies"
      ],
      "effective_date": "Ongoing under federal and state law",
      "confidence_level": "high",
      "source_url": "https://www.azleg.gov/ars/12/01501.htm",
      "notes": "Arizona is arbitration-friendly. Courts enforce valid arbitration agreements."
    },
    {
      "topic": "at_will_employment",
      "summary": "Arizona follows at-will employment doctrine. Either party can terminate employment at any time for any legal reason or no reason. Exceptions exist for discrimination, retaliation, public policy violations, and breach of contract. Arizona is generally employer-friendly.",
      "statute_citation": "Common law doctrine; A.R.S. § 23-1501 (Civil Rights Act - anti-discrimination); A.R.S. § 23-1502 (employment at will)",
      "requirements": [
        "Default: Employment terminable at will by either party (A.R.S. § 23-1501(2))",
        "No notice required unless contract/policy requires it",
        "Final wages must be paid within 7 working days or by next regular payday, whichever is sooner",
        "EXCEPTIONS - Cannot terminate for: Race, color, religion, sex, age, disability, national origin discrimination (Arizona Civil Rights Act)",
        "Cannot terminate for: Retaliation (workers' comp claim, jury duty, voting, military service)",
        "Cannot terminate for: Violation of public policy (refusing illegal acts, exercising statutory rights)",
        "Cannot terminate for: Breach of employment contract (written or implied)",
        "Employment handbooks may create implied contracts if not properly disclaimed",
        "Written employment contracts override at-will status",
        "Union/collective bargaining agreements override at-will status",
        "Arizona courts narrowly construe at-will exceptions"
      ],
      "effective_date": "Ongoing common law and statutory",
      "confidence_level": "high",
      "source_url": "https://www.azleg.gov/ars/23/01501.htm",
      "notes": "Arizona is strongly at-will employment state with typical exceptions. Handbook disclaimers recommended."
    },
    {
      "topic": "drug_screening",
      "summary": "Arizona has NO state statute restricting private employer drug testing. Employers may conduct pre-employment, random, reasonable suspicion, and post-accident testing. Medical marijuana users have limited protections under Arizona Medical Marijuana Act (AMMA). Drug-free workplace programs may receive workers' comp premium discounts.",
      "statute_citation": "A.R.S. § 36-2813 (Arizona Medical Marijuana Act); A.R.S. § 23-493.04 (drug testing and workers' comp); No general restriction statute",
      "requirements": [
        "STATEWIDE: No general restriction on private employer drug testing",
        "Pre-employment testing: Permitted",
        "Random testing: Permitted",
        "Reasonable suspicion testing: Permitted",
        "Post-accident testing: Permitted",
        "MEDICAL MARIJUANA: AMMA prohibits discrimination against medical marijuana cardholders",
        "MEDICAL MARIJUANA: Employers cannot discriminate solely based on positive test for marijuana or cardholder status",
        "MEDICAL MARIJUANA: EXCEPTION: Can take action if employee is impaired at work or used/possessed marijuana at workplace",
        "MEDICAL MARIJUANA: EXCEPTION: Can take action if it would cause employer to lose federal contract or federal licensing-related benefit",
        "MEDICAL MARIJUANA: No requirement to accommodate on-site use",
        "RECREATIONAL MARIJUANA: No workplace protections (approved by voters 2020, effective 2021)",
        "Workers' comp: Drug-free workplace programs can reduce comp premiums up to 5%",
        "Recommended: Written drug testing policy",
        "Federal DOT requirements apply to transportation/safety-sensitive positions"
      ],
      "effective_date": "AMMA: 2010; Recreational: 2021; Workers' comp provisions ongoing",
      "confidence_level": "high",
      "source_url": "https://www.azleg.gov/ars/36/02813.htm",
      "notes": "Arizona medical marijuana law provides limited employee protections but allows employer action for impairment. Recreational users have no protections."
    }
  ],
  "data_quality": {
    "last_updated": "2026-01-13",
    "sources": "Arizona statutes (A.R.S.), federal laws, legal analysis from employment law firms",
    "verification_status": "verified_from_official_sources",
    "coverage_completeness": "comprehensive"
  },
  "additional_notes": {
    "general_guidance": "Arizona is generally employer-friendly with minimal employment regulations beyond federal law. Medical marijuana creates some testing complexity. No statewide paid leave or pay transparency requirements.",
    "enforcement_agencies": [
      "Arizona Attorney General's Office - Civil Rights Division",
      "Arizona Industrial Commission",
      "U.S. Equal Employment Opportunity Commission (EEOC)",
      "U.S. Department of Labor"
    ],
    "recent_developments": [
      "Recreational marijuana approved 2020, no workplace protections",
      "Federal FTC non-compete ban blocked August 2024",
      "No major state employment law changes in 2025-2026"
    ]
  }
}