{
  "state": "Oregon",
  "state_code": "OR",
  "laws": [
    {
      "topic": "non-compete",
      "summary": "Oregon restricts non-compete agreements significantly. O.R.S. § 653.295 prohibits non-competes for employees earning less than $123,428/year (2026 threshold, adjusted biennially). For higher earners, non-competes limited to 12 months maximum. Healthcare practitioners (physicians, NPs, PAs, etc.) are prohibited from non-competes entirely as of July 1, 2025.",
      "statute_citation": "O.R.S. § 653.295 (Non-Compete Agreements); O.R.S. § 653.640 (Healthcare Practitioner Non-Competes)",
      "requirements": [
        "WAGE THRESHOLD: Cannot enforce non-compete for employees earning less than $123,428/year (2026 threshold, adjusted every 2 years based on median family income)",
        "For employees above threshold: Non-compete limited to 12 months maximum",
        "Must provide written notice of non-compete at job offer or 2 weeks before start of employment",
        "Must be in writing",
        "Geographic scope must be reasonable",
        "HEALTHCARE PRACTITIONERS: Non-competes PROHIBITED for physicians, nurse practitioners, physician assistants, optometrists, dentists, dental hygienists (effective July 1, 2025)",
        "HEALTHCARE: Exception for sale of practice",
        "Non-solicitation agreements: More lenient - can enforce for employees earning $103,690+ (2026 threshold)",
        "Customer non-solicitation: Maximum 18 months",
        "Employee must receive bona fide advancement (promotion, salary increase, or other consideration) for existing employee non-compete",
        "Courts will NOT blue-pencil unreasonable provisions",
        "Void non-competes: Employer may be liable for attorney fees"
      ],
      "effective_date": "2008 (original); Amended 2025 (healthcare ban)",
      "confidence_level": "high",
      "source_url": "https://www.oregonlegislature.gov/bills_laws/ors/ors653.html",
      "notes": "Oregon significantly restricts non-competes. Healthcare practitioner ban took effect July 2025. Wage thresholds adjusted biennially. Federal FTC ban blocked but Oregon law already restrictive."
    },
    {
      "topic": "salary_history",
      "summary": "Oregon prohibits employers from asking about salary history. O.R.S. § 652.220 prevents employers from screening applicants based on salary history or requiring disclosure of current/past compensation. One of the early adopter states.",
      "statute_citation": "O.R.S. § 652.220 (Equal Pay - Salary History)",
      "requirements": [
        "Employers cannot screen applicants based on current or past compensation",
        "Cannot require disclosure of salary history as condition of employment",
        "Cannot require disclosure as condition for being interviewed",
        "Cannot determine whether to interview based on salary history",
        "Applicant may voluntarily disclose salary history without prompting",
        "If voluntarily disclosed, employer may verify and consider",
        "Does not prohibit asking about salary expectations",
        "Applies to all Oregon employers",
        "Violations: Civil penalties enforced by Commissioner of Bureau of Labor and Industries (BOLI)",
        "Effective October 6, 2017"
      ],
      "effective_date": "2017-10-06",
      "confidence_level": "high",
      "source_url": "https://www.oregon.gov/boli/workers/pages/equal-pay.aspx",
      "notes": "Oregon was one of first states to ban salary history inquiries. Part of broader pay equity law."
    },
    {
      "topic": "pay_transparency",
      "summary": "Oregon requires pay transparency. O.R.S. § 652.210 requires employers with 15+ employees to include salary range or wage scale in job postings. Must also provide pay scale information to current employees upon request or hire/transfer/promotion.",
      "statute_citation": "O.R.S. § 652.210 (Pay Transparency - Wage Disclosure)",
      "requirements": [
        "Applies to employers with 15 or more employees",
        "Must include salary range or wage scale in ALL job postings for positions in Oregon",
        "Posting must show: minimum and maximum salary/wage for position",
        "Must include general description of benefits and other compensation",
        "Applies to: external job postings, internal postings, transfer opportunities, promotional opportunities",
        "Includes remote positions if work performed in Oregon",
        "Must provide wage scale information to employees: upon hire, upon transfer to new position, upon promotion, at any time upon request",
        "Cannot retaliate against employees who discuss wages",
        "Cannot prohibit employees from disclosing their own wages",
        "Violations: Enforced by Oregon Bureau of Labor and Industries (BOLI), civil penalties",
        "Effective January 1, 2025"
      ],
      "effective_date": "2025-01-01",
      "confidence_level": "high",
      "source_url": "https://www.oregon.gov/boli/workers/pages/equal-pay.aspx",
      "notes": "Oregon pay transparency law took effect January 2025. Applies to employers with 15+ employees."
    },
    {
      "topic": "background_checks",
      "summary": "Oregon has comprehensive ban-the-box law. O.R.S. § 659A.360 prohibits employers from asking about criminal history on initial applications or before initial interview. Must conduct individualized assessment. Cannot consider arrests more than 3 years old without conviction.",
      "statute_citation": "O.R.S. § 659A.360 (Criminal History in Employment); Federal FCRA (15 U.S.C. § 1681)",
      "requirements": [
        "Cannot ask about criminal history on initial employment application",
        "Cannot ask about criminal history before initial interview",
        "Cannot conduct background check before initial interview",
        "After initial interview: May inquire about criminal history and conduct background check",
        "Cannot consider: arrests not resulting in conviction (if more than 3 years old), expunged/sealed records, juvenile records",
        "Must conduct individualized assessment before taking adverse action",
        "Must consider: nature/gravity of offense, time elapsed, nature of job sought, evidence of rehabilitation",
        "Must provide written notice before adverse action",
        "Applicant has 5 business days to respond with evidence of inaccuracy or rehabilitation",
        "Exceptions: Positions where law prohibits hiring with certain convictions",
        "FCRA: Must get written consent for background check",
        "FCRA: Must provide pre-adverse action and final adverse action notices",
        "Violations: Enforced by Oregon Bureau of Labor and Industries (BOLI)",
        "Civil penalties: Up to $1,000 per violation"
      ],
      "effective_date": "2016 (private employers); Expanded subsequently",
      "confidence_level": "high",
      "source_url": "https://www.oregon.gov/boli/workers/pages/ban-the-box.aspx",
      "notes": "Oregon has strong ban-the-box protections. Cannot ask about criminal history until after initial interview. Must conduct individualized assessment."
    },
    {
      "topic": "paid_leave",
      "summary": "Oregon has comprehensive paid sick leave law. O.R.S. § 653.601 et seq. requires all employers to provide earned sick time. Employees accrue minimum 1 hour per 30 hours worked (or 1 hour per 40 for employers with 10+ employees in Portland metro). Oregon also has Paid Leave Oregon program for family/medical leave starting September 2023.",
      "statute_citation": "O.R.S. § 653.601 et seq. (Paid Sick Leave); O.R.S. § 657B.010 et seq. (Paid Leave Oregon)",
      "requirements": [
        "PAID SICK LEAVE: Applies to ALL Oregon employers regardless of size",
        "PAID SICK LEAVE: Employees accrue minimum 1 hour per 30 hours worked",
        "PAID SICK LEAVE: Employers with 10+ employees (or 6+ in Portland metro): paid sick time",
        "PAID SICK LEAVE: Smaller employers: unpaid sick time",
        "PAID SICK LEAVE: Maximum 40 hours per year",
        "PAID SICK LEAVE: Can use after 91st calendar day of employment",
        "PAID SICK LEAVE: Carries over year to year (employer may cap accrual at 80 hours)",
        "PAID SICK LEAVE: Use for: illness/injury, medical care, public health emergency, child's illness/care, domestic violence/harassment/sexual assault/stalking situations, bereavement",
        "PAID SICK LEAVE: NOT required to pay out at termination",
        "PAID LEAVE OREGON: State-run program provides up to 12 weeks paid leave (14 for pregnancy disability, 16 combined)",
        "PAID LEAVE OREGON: Covers: serious health condition, family care, bonding with child, safe leave",
        "PAID LEAVE OREGON: Funded by payroll contributions (employer + employee)",
        "PAID LEAVE OREGON: Applies to employees who worked 120 days in Oregon",
        "PAID LEAVE OREGON: Started September 3, 2023",
        "Records must be maintained for 3 years",
        "Retaliation prohibited"
      ],
      "effective_date": "Paid sick leave: 2016-01-01; Paid Leave Oregon: 2023-09-03",
      "confidence_level": "high",
      "source_url": "https://www.oregon.gov/boli/workers/pages/paid-sick-time.aspx",
      "notes": "Oregon has comprehensive paid leave system. State-run Paid Leave Oregon provides family/medical leave benefits. Separate paid sick leave law for all employers."
    },
    {
      "topic": "arbitration",
      "summary": "Oregon enforces arbitration agreements under federal and state law but with employee protections. Follows Federal Arbitration Act. Oregon Uniform Arbitration Act governs. Courts scrutinize for fairness and may find unconscionable if one-sided.",
      "statute_citation": "Federal Arbitration Act (9 U.S.C. §§ 1-16); O.R.S. § 36.600 et seq. (Uniform Arbitration Act)",
      "requirements": [
        "Arbitration agreements generally enforceable under FAA",
        "Must be in writing and clearly presented",
        "Must have mutual agreement to arbitrate",
        "Must identify claims subject to arbitration",
        "Cannot be procedurally or substantively unconscionable",
        "Must provide for neutral arbitrator",
        "Cannot impose unreasonable costs on employee",
        "Adequate consideration required",
        "Oregon courts scrutinize arbitration agreements for fairness",
        "Class action waivers generally enforceable but may be challenged",
        "Pre-dispute arbitration agreements enforceable if fair",
        "Can be challenged on unconscionability grounds",
        "Federal policy favoring arbitration applies but state law provides protections"
      ],
      "effective_date": "Ongoing under federal and state law",
      "confidence_level": "high",
      "source_url": "https://www.oregonlegislature.gov/bills_laws/ors/ors036.html",
      "notes": "Oregon enforces arbitration but with employee-friendly scrutiny. Must be procedurally fair."
    },
    {
      "topic": "at_will_employment",
      "summary": "Oregon follows at-will employment doctrine with significant exceptions. Either party can terminate employment for any legal reason. Strong anti-discrimination protections, whistleblower protections, and public policy exceptions. Oregon is moderately employee-friendly.",
      "statute_citation": "Common law doctrine; O.R.S. § 659A.030 (Oregon Equality Act - anti-discrimination)",
      "requirements": [
        "Default: Employment terminable at will by either party",
        "No notice required unless contract/policy requires it",
        "Final wages: If employee quits with 48+ hours notice, must pay immediately; if less notice, within 5 days or next payday, whichever comes first; if terminated, must pay by end of next business day",
        "EXCEPTIONS - Cannot terminate for: Race, color, religion, sex, sexual orientation, gender identity, national origin, marital status, age 18+, disability, source of income, domestic violence victim status, familial status, expunged juvenile record (Oregon Equality Act - very broad)",
        "Cannot terminate for: Retaliation (whistleblowing, workers' comp, wage claims, jury duty, military service, victim of crime assistance)",
        "Cannot terminate for: Serving as volunteer firefighter/emergency responder",
        "Cannot terminate for: Off-duty legal marijuana use (with exceptions for safety-sensitive positions)",
        "Cannot terminate for: Violation of public policy",
        "Cannot terminate for: Breach of employment contract",
        "Employment handbooks may create enforceable obligations if not properly disclaimed",
        "Written employment contracts override at-will status",
        "Union/collective bargaining agreements override at-will status"
      ],
      "effective_date": "Ongoing common law and statutory",
      "confidence_level": "high",
      "source_url": "https://www.oregon.gov/boli/workers/pages/protected-classes.aspx",
      "notes": "Oregon has strong employee protections including broad anti-discrimination law and marijuana protections. Handbook disclaimers important."
    },
    {
      "topic": "drug_screening",
      "summary": "Oregon restricts drug testing, particularly for marijuana. O.R.S. § 659A.300 prohibits employment discrimination for off-duty marijuana use. Employers must have reasonable suspicion of impairment. Pre-employment marijuana testing significantly limited. Safety-sensitive positions have more latitude.",
      "statute_citation": "O.R.S. § 659A.300 et seq. (Marijuana Use); O.R.S. § 659A.300 (Drug/Alcohol Testing)",
      "requirements": [
        "Cannot discriminate based on off-duty marijuana use (with exceptions)",
        "Pre-employment marijuana testing: Prohibited for most positions (as of 2024)",
        "Cannot refuse to hire solely based on pre-employment marijuana test",
        "EXCEPTIONS: Can test and take action for: safety-sensitive positions, positions requiring federal background checks/contracts/licensing, positions with potential adverse impact on safety of others, positions where impairment could create unacceptable risk",
        "Random testing: Only permitted for safety-sensitive positions",
        "Reasonable suspicion testing: Permitted if observable evidence of impairment",
        "Post-accident testing: Permitted",
        "Must have written drug testing policy",
        "Policy must be provided to employees/applicants",
        "Testing must be conducted by qualified lab",
        "Cannot test based solely on smell of marijuana",
        "Must establish observable impairment, not just positive test",
        "Medical marijuana: Same protections as recreational",
        "Federal contractors: Must comply with Drug-Free Workplace Act",
        "DOT-regulated positions: Must follow federal testing requirements",
        "Workers' comp: Drug testing provisions may affect claims"
      ],
      "effective_date": "Marijuana protections: 2015 (legalization); Enhanced protections: ongoing",
      "confidence_level": "high",
      "source_url": "https://www.oregon.gov/boli/workers/pages/cannabis.aspx",
      "notes": "Oregon has strong marijuana employee protections. Pre-employment marijuana testing largely prohibited. Cannot discriminate for off-duty use unless safety-sensitive. Must show impairment, not just use."
    }
  ],
  "data_quality": {
    "last_updated": "2026-01-13",
    "sources": "Oregon statutes (O.R.S.), Oregon Bureau of Labor and Industries (BOLI), legal analysis",
    "verification_status": "verified_from_official_sources",
    "coverage_completeness": "comprehensive"
  },
  "additional_notes": {
    "general_guidance": "Oregon is VERY employee-friendly with comprehensive worker protections. Strong non-compete restrictions (including healthcare ban), pay transparency, paid sick leave, state-run paid family leave, marijuana protections, and broad anti-discrimination law create significant compliance requirements.",
    "enforcement_agencies": [
      "Oregon Bureau of Labor and Industries (BOLI)",
      "Oregon Employment Department",
      "Paid Leave Oregon (state program)",
      "U.S. Equal Employment Opportunity Commission (EEOC)",
      "U.S. Department of Labor"
    ],
    "recent_developments": [
      "Healthcare practitioner non-compete ban effective July 1, 2025",
      "Pay transparency law effective January 1, 2025",
      "Paid Leave Oregon launched September 3, 2023",
      "Pre-employment marijuana testing restrictions enhanced 2024",
      "One of most comprehensive employment law states in U.S."
    ]
  }
}